### INCOMING STAGE INFRASTRUCTURE CHANGES:
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/landon/github-actions-iac-demo_stage/runs/run-6uyCaH5NxrihoK8e

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.test_bucket: Refreshing state... [id=stage-github-actions-iac-demo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket.host_bucket will be created
  + resource "aws_s3_bucket" "host_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "stage-github-actions-iac-demo"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stage"
          + "Name"        = "Landon Test Bucket for Github Actions IAC Demo..."
        }
      + tags_all                    = {
          + "Environment" = "stage"
          + "Name"        = "Landon Test Bucket for Github Actions IAC Demo..."
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.test_bucket will be destroyed
  - resource "aws_s3_bucket" "test_bucket" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::stage-github-actions-iac-demo" -> null
      - bucket                      = "stage-github-actions-iac-demo" -> null
      - bucket_domain_name          = "stage-github-actions-iac-demo.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "stage-github-actions-iac-demo.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "stage-github-actions-iac-demo" -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "stage"
          - "Name"        = "Landon Test Bucket for Github Actions IAC Demo..."
        } -> null
      - tags_all                    = {
          - "Environment" = "stage"
          - "Name"        = "Landon Test Bucket for Github Actions IAC Demo..."
        } -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)

```

</details>

*Pusher: @landonnewberry, Action: `pull_request`*